clear;clc;

%% 中心天体参数
mu = 3.986004418e14;% m^3/s^2
Re = 6378137;       % m
J2 = 1.08262668e-3; % 
omegaE = 7.2921159e-5; % rad/s
h_ref = 400e3;      % m
rho_ref = 3e-12;    % kg/m^3
H = 50e3;           % m

%% 环境与轨道动力学子系统
% 大气阻力
Cd = 2.2;           % 
area_d = 4;         % m^2
m = 500;            % kg
% 初始位置和速度
x0 = 7e6;           % m
y0 = 0;             % m
z0 = 0;             % m
vx0 = 0;            % m/s
vy0 = 7546;       % m/s
vz0 = 0;            % m/s
% 太阳光压参数
P0 = 4.56e-6;       % N/m^2
Cr = 1.2;           % 1~1.8
area_s = 2;         % m^2
hat_s = [1,0,0];    % 惯性系

%% 电源子系统
% 外部环境
sunlit = 1;         % 日照标志,0/1
P_panel = 300;      % 发电功率，W
% 负载功耗
P_base = 50;        % 基础功耗，W
P_adcs = 20;        % 姿态确认与控制功耗，W
P_comm = 40;        % 通信功耗，W
E_max = 7.2e5;      % J，约200Wh
SOC0 = 0.6;         % 80%初始电量
E0 = E_max * SOC0;  % J，
SOC_low_comm = 0.2; % 低于 20% 关通信功耗
SOC_low_adcs = 0.1; % 低于 10% 关姿态功耗
% 充放电参数
P_trickle = 14;     % 涓流充电功率，W
P_cc = 220;         % 稳流充电功率，W
SOC1 = 0.2;         % 涓流|稳流
SOC2 = 0.8;         % 稳流|稳压
% 蓄电池参数

%% 姿态确定与控制子系统
J = 30;             % kg*m^2, 航天器框架转动惯量
w0 = 0;             % 初始角速度
angle0 = 0;         % 初始角度
Kp = 0.03;          % 姿态控制器-比例系数
Ki = 0.01;         % 姿态控制器-积分系数
Torque_limit = 0.2; % N*m，控制力矩限幅